In [25]:
"""
Created on: Mon. 29 Aug. 2022
Author: Mélina Verger
"""

# For data manipulation
import pandas as pd

# To handle ZIP files
import zipfile

In [26]:
zf = zipfile.ZipFile("./data/data.zip")

In [30]:
studentInfo = pd.read_csv(zf.open("studentInfo.csv"))
studentAssessment = pd.read_csv(zf.open("studentAssessment.csv"))
studentVle = pd.read_csv(zf.open("studentVle.csv"))
assessments = pd.read_csv(zf.open("assessments.csv"))

## Merge assessments information

In [31]:
studentAssessment

        id_assessment  id_student  date_submitted  is_banked  score
0                1752       11391              18          0   78.0
1                1752       28400              22          0   70.0
2                1752       31604              17          0   72.0
3                1752       32885              26          0   69.0
4                1752       38053              19          0   79.0
...               ...         ...             ...        ...    ...
173907          37443      527538             227          0   60.0
173908          37443      534672             229          0  100.0
173909          37443      546286             215          0   80.0
173910          37443      546724             230          0  100.0
173911          37443      558486             224          0   80.0

[173912 rows x 5 columns]

In [32]:
assessments

,code_module,code_presentation,id_assessment,assessment_type,date,weight
0,AAA,2013J,1752,TMA,19.0,10.0
1,AAA,2013J,1753,TMA,54.0,20.0
2,AAA,2013J,1754,TMA,117.0,20.0
3,AAA,2013J,1755,TMA,166.0,20.0
4,AAA,2013J,1756,TMA,215.0,30.0
...,...,...,...,...,...,...
201,GGG,2014J,37443,CMA,229.0,0.0
202,GGG,2014J,37435,TMA,61.0,0.0
203,GGG,2014J,37436,TMA,124.0,0.0
204,GGG,2014J,37437,TMA,173.0,0.0
205,GGG,2014J,37444,Exam,229.0,100.0

In [61]:
studentScore = pd.merge(studentAssessment, assessments, how="inner", on="id_assessment")
studentScore = studentScore.drop(columns=["date_submitted", "is_banked", "date"])

In [62]:
studentScore

,id_assessment,id_student,score,code_module,code_presentation,assessment_type,weight
0,1752,11391,78.0,AAA,2013J,TMA,10.0
1,1752,28400,70.0,AAA,2013J,TMA,10.0
2,1752,31604,72.0,AAA,2013J,TMA,10.0
3,1752,32885,69.0,AAA,2013J,TMA,10.0
4,1752,38053,79.0,AAA,2013J,TMA,10.0
...,...,...,...,...,...,...,...
173907,37443,527538,60.0,GGG,2014J,CMA,0.0
173908,37443,534672,100.0,GGG,2014J,CMA,0.0
173909,37443,546286,80.0,GGG,2014J,CMA,0.0
173910,37443,546724,100.0,GGG,2014J,CMA,0.0
173911,37443,558486,80.0,GGG,2014J,CMA,0.0

## Aggregate assessments information

In [64]:
studentScore["weighted_score"] = studentScore["score"] * studentScore["weight"]

In [69]:
studentScore[studentScore["id_student"]==11391]

,id_assessment,id_student,score,code_module,code_presentation,assessment_type,weight,weighted_score
0,1752,11391,78.0,AAA,2013J,TMA,10.0,780.0
501,1753,11391,85.0,AAA,2013J,TMA,20.0,1700.0
842,1754,11391,80.0,AAA,2013J,TMA,20.0,1600.0
1032,1755,11391,85.0,AAA,2013J,TMA,20.0,1700.0
1457,1756,11391,82.0,AAA,2013J,TMA,30.0,2460.0

In [65]:
studentScore

,id_assessment,id_student,score,code_module,code_presentation,assessment_type,weight,weighted_score
0,1752,11391,78.0,AAA,2013J,TMA,10.0,780.0
1,1752,28400,70.0,AAA,2013J,TMA,10.0,700.0
2,1752,31604,72.0,AAA,2013J,TMA,10.0,720.0
3,1752,32885,69.0,AAA,2013J,TMA,10.0,690.0
4,1752,38053,79.0,AAA,2013J,TMA,10.0,790.0
...,...,...,...,...,...,...,...,...
173907,37443,527538,60.0,GGG,2014J,CMA,0.0,0.0
173908,37443,534672,100.0,GGG,2014J,CMA,0.0,0.0
173909,37443,546286,80.0,GGG,2014J,CMA,0.0,0.0
173910,37443,546724,100.0,GGG,2014J,CMA,0.0,0.0
173911,37443,558486,80.0,GGG,2014J,CMA,0.0,0.0

In [68]:
studentScore.groupby(["code_module", "code_presentation", "id_student"]).sum()

                                          id_assessment  score  weight  \
code_module code_presentation id_student
AAA         2013J             11391                8770  410.0   100.0
                              28400                8770  332.0   100.0
                              31604                8770  380.0   100.0
                              32885                8770  272.0   100.0
                              38053                8770  340.0   100.0
...                                                 ...    ...     ...
GGG         2014J             2620947            336951  800.0     0.0
                              2645731            336951  793.0     0.0
                              2648187            336951  690.0     0.0
                              2679821             74873  183.0     0.0
                              2684003            262066  580.0     0.0

                                          weighted_score
code_module code_presentation id_student
AAA         2013J             11391               8240.0
                              28400               6540.0
                              31604               7630.0
                              32885               5500.0
                              38053               6690.0
...                                                  ...
GGG         2014J             2620947                0.0
                              2645731                0.0
                              2648187                0.0
                              2679821                0.0
                              2684003                0.0

[25843 rows x 4 columns]

## Aggregate click information

In [36]:
studentVle

         code_module code_presentation  id_student  id_site  date  sum_click
0                AAA             2013J       28400   546652   -10          4
1                AAA             2013J       28400   546652   -10          1
2                AAA             2013J       28400   546652   -10          1
3                AAA             2013J       28400   546614   -10         11
4                AAA             2013J       28400   546714   -10          1
...              ...               ...         ...      ...   ...        ...
10655275         GGG             2014J      675811   896943   269          3
10655276         GGG             2014J      675578   896943   269          1
10655277         GGG             2014J      654064   896943   269          3
10655278         GGG             2014J      654064   896939   269          1
10655279         GGG             2014J      654064   896939   269          1

[10655280 rows x 6 columns]

In [50]:
studentClick = studentVle.groupby(["code_module", "code_presentation", "id_student"]).sum()
studentClick = studentClick.drop(columns=["id_site", "date"])

In [51]:
studentClick

                                          sum_click
code_module code_presentation id_student
AAA         2013J             11391             934
                              28400            1435
                              30268             281
                              31604            2158
                              32885            1034
...                                             ...
GGG         2014J             2640965            41
                              2645731           893
                              2648187           312
                              2679821           275
                              2684003           616

[29228 rows x 1 columns]

In [44]:
# To check the group by (change the id_student number and verify the sum)
# studentVle[studentVle["code_module"]=="AAA"][studentVle["code_presentation"]=="2013J"][studentVle["id_student"]==30268]["sum_click"].sum()

## Merge studentInfo with click

In [55]:
studentAll = pd.merge(studentInfo, studentClick, how="inner", on=["code_module", "code_presentation", "id_student"])
# It is normal if with inner join the number of rows goes from 32593 (rows from studentInfo) to 29228 (rows from studentClick) because of the duplicates in studentInfo

In [53]:
pd.merge(studentAll, studentClick, how="inner", on=["code_module", "code_presentation", "id_student"])

,code_module,code_presentation,id_student,gender,region,highest_education,imd_band,age_band,num_of_prev_attempts,studied_credits,disability,final_result
0,AAA,2013J,11391,M,East Anglian Region,HE Qualification,90-100%,55<=,0,240,N,Pass
1,AAA,2013J,28400,F,Scotland,HE Qualification,20-30%,35-55,0,60,N,Pass
2,AAA,2013J,30268,F,North Western Region,A Level or Equivalent,30-40%,35-55,0,60,Y,Withdrawn
3,AAA,2013J,31604,F,South East Region,A Level or Equivalent,50-60%,35-55,0,60,N,Pass
4,AAA,2013J,32885,F,West Midlands Region,Lower Than A Level,50-60%,0-35,0,60,N,Pass
...,...,...,...,...,...,...,...,...,...,...,...,...
32588,GGG,2014J,2640965,F,Wales,Lower Than A Level,10-20,0-35,0,30,N,Fail
32589,GGG,2014J,2645731,F,East Anglian Region,Lower Than A Level,40-50%,35-55,0,30,N,Distinction
32590,GGG,2014J,2648187,F,South Region,A Level or Equivalent,20-30%,0-35,0,30,Y,Pass
32591,GGG,2014J,2679821,F,South East Region,Lower Than A Level,90-100%,35-55,0,30,N,Withdrawn
32592,GGG,2014J,2684003,F,Yorkshire Region,HE Qualification,50-60%,35-55,0,30,N,Distinction